2019/biginteger.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-10-31 四 11:27 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>大数的简单实现</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">
<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">大数的简单实现</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org50c7ce7">1. 前言</a></li>
<li><a href="#org3aee07b">2. 字符数组的本质</a></li>
<li><a href="#org3bc09ca">3. 整数数组与 1000000000 进制</a></li>
<li><a href="#org9ebebe6">4. 小端模式存储</a></li>
<li><a href="#org2217c32">5. 和 10 进制字符串之间的转换</a></li>
<li><a href="#orgb24d0b6">6. 大数加法</a></li>
<li><a href="#org755a085">7. 大数乘法</a></li>
<li><a href="#org4ffdf72">8. 结语</a></li>
<li><a href="#orgbc5bea8">9. 参考链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-org50c7ce7" class="outline-2">
<h2 id="org50c7ce7"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
大数的实现应该是很多人在初学编程不久后就会遇到的一个问题，常见的问题就是 <b>大数加法</b> 的实现，更进一步便是 <b>大数乘法</b>.
</p>

<p>
初学时解决这两个问题的一般思路就是通过 <b>字符数组</b> 来表示一个大数，然后通过模拟人工的竖式计算来实现相关运算。
</p>

<p>
我们可以基于这种思路简单扩展一下大数的实现方式。
</p>
</div>
</div>

<div id="outline-container-org3aee07b" class="outline-2">
<h2 id="org3aee07b"><span class="section-number-2">2</span> 字符数组的本质</h2>
<div class="outline-text-2" id="text-2">
<p>
通过字符数组表示大数的本质是什么，比如像这样一个字符数组：
</p>
<pre class="example">
['1', '2', '3', '4', '5', '6', '7', '8', '9', '8', '7', '6', '5', '4', '3', '2', '1']
</pre>

<p>
它表示大数 <code>12345678987654321</code>, 它是通过怎样的形式来表示的呢？
</p>

<p>
答：通过 <b>10 进制数组</b> 的形式来表示的，数组中每个元素的表示范围为 <code>[0, 9]</code>.
</p>

<p>
但是很明显，就算是在 <code>C</code> 语言中，存储一个字符也至少需要一个字节，而一个字节能够表示 <code>[0, 255]</code>, 我们却只拿来存储 <code>[0, 9]</code> 的数字，这显得有点奢侈。
</p>

<p>
而进制这个东西，是可以在计算过程中进行转换的，那么，我们是不是可以让一个字节多存储一点数据，比如说 <code>[0, 99]</code> 之类的？
</p>

<p>
那么更一般的，我们必须用 <b>字符数组</b> 吗？如果用 <b>整数数组</b> 又是怎样的？
</p>
</div>
</div>

<div id="outline-container-org3bc09ca" class="outline-2">
<h2 id="org3bc09ca"><span class="section-number-2">3</span> 整数数组与 1000000000 进制</h2>
<div class="outline-text-2" id="text-3">
<p>
通过前面的思考，我们可以发现，通过 <b>字符数组</b> 来实现大数的方式其实就是：
</p>
<ul class="org-ul">
<li>通过一个 <b>N 进制</b> 的 <b>数组</b> 来表示一个大数，然后通过模拟人工的竖式计算来实现相关的大数运算</li>
</ul>

<p>
那么，我们只需要通过一点简单的进制转换，就可以使用 <b>整数数组</b> 来替代 <b>字符数组</b>.
</p>

<p>
这里我们可以选择 <b>1000000000 进制</b> 的 <b>整数数组</b> 来实现大数，这样选择的理由：
</p>
<ul class="org-ul">
<li><b>10 进制</b> 的 <b>N</b> 次方可以很方便的实现和十进制之间的转换，而 <b>1000000000</b> 是一个整数能够表示的最大的 10 的 N 次方</li>
<li><p>
<b>整数数组</b> 的空间利用率比 <b>字符数组</b> 更高，同时用四个字节来表示大数：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-left">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">数组类型</th>
<th scope="col" class="org-right">进制</th>
<th scope="col" class="org-left">最大大数 - 数组形式</th>
<th scope="col" class="org-right">最大大数</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">字符数组</td>
<td class="org-right">100</td>
<td class="org-left">[99, 99, 99, 99]</td>
<td class="org-right">99999999</td>
</tr>

<tr>
<td class="org-left">整数数组</td>
<td class="org-right">1000000000</td>
<td class="org-left">[999999999]</td>
<td class="org-right">999999999</td>
</tr>
</tbody>
</table>

<p>
可以看到，即使字符数组使用 <b>100</b> 进制来表示大数，整数数组能够表示的最大大数也是字符数组的 10 倍。
</p></li>
</ul>

<p>
因此，整数数组和 1000000000 是一个不错的选择。
</p>
</div>
</div>

<div id="outline-container-org9ebebe6" class="outline-2">
<h2 id="org9ebebe6"><span class="section-number-2">4</span> 小端模式存储</h2>
<div class="outline-text-2" id="text-4">
<p>
我们选择了整数数组和 1000000000 进制实现大数，其中，整数数组的每个元素最多存储 9 位十进制数字：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">private</span> <span class="org-keyword">final</span> <span class="org-keyword">static</span> <span class="org-type">int</span> <span class="org-variable-name">BASE</span> = 1000000000;
<span class="org-keyword">private</span> <span class="org-keyword">final</span> <span class="org-keyword">static</span> <span class="org-type">int</span> <span class="org-variable-name">BASE_DECIMAL_DIGITS</span> = 9;
</pre>
</div>

<p>
然后需要考虑的就是大数的存储模式，和计算机内存中数据的存储一样，这里我们有 <b>大端</b> 和 <b>小端</b> 两种存储模式可以选择，其中，大端形式可以方便人的阅读，而小端可以方便相关大数计算的实现。
</p>

<p>
阅读方面可以选择通过直接将大数打印为十进制字符串，因此，这里选择小端的存储模式：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-doc">/**</span>
<span class="org-doc"> * Create large numbers based on small endian integer arrays</span>
<span class="org-doc"> *</span>
<span class="org-doc"> * Array [999999999, 1] representing large numbers 1999999999</span>
<span class="org-doc"> *</span>
<span class="org-doc"> * NOTE: The range of values &#8203;&#8203;for each element of the array is [0, 999999999]</span>
<span class="org-doc"> */</span>
<span class="org-keyword">public</span> <span class="org-function-name">BigInteger</span>(<span class="org-type">int</span>... <span class="org-variable-name">digits</span>) {
  <span class="org-keyword">if</span> (digits.length &gt; 0) {
    <span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">digit</span> : digits) {
      <span class="org-keyword">if</span> (digit &lt; 0 || digit &gt;= BASE) {
        <span class="org-keyword">throw</span> <span class="org-keyword">new</span> <span class="org-type">IllegalArgumentException</span>(String.format(<span class="org-string">"Digit %d out of range !"</span>, digit));
      }
    }
    <span class="org-keyword">this</span>.digits = digits.clone();
  } <span class="org-keyword">else</span> {
    <span class="org-keyword">this</span>.digits = <span class="org-keyword">new</span> <span class="org-type">int</span>[] {0};
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2217c32" class="outline-2">
<h2 id="org2217c32"><span class="section-number-2">5</span> 和 10 进制字符串之间的转换</h2>
<div class="outline-text-2" id="text-5">
<p>
将 10 进制字符串转换为 1000000000 进制的整数数组时，只需要按 9 个数字一组的方式分割原字符串就可以了：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-doc">/**</span>
<span class="org-doc"> * Create large numbers based on decimal strings</span>
<span class="org-doc"> */</span>
<span class="org-keyword">public</span> <span class="org-function-name">BigInteger</span>(<span class="org-type">String</span> <span class="org-variable-name">digitsString</span>) {
  <span class="org-type">int</span> <span class="org-variable-name">stringLength</span> = digitsString.length();
  <span class="org-comment-delimiter">// </span><span class="org-comment">Array size required to store large numbers, equal ceil(digitsLength / BASE_DECIMAL_DIGITS)</span>
  <span class="org-type">int</span> <span class="org-variable-name">digitsLength</span> = (stringLength - 1) / BASE_DECIMAL_DIGITS + 1;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Length of the large number of heads</span>
  <span class="org-type">int</span> <span class="org-variable-name">head</span> = stringLength % BASE_DECIMAL_DIGITS;

  <span class="org-keyword">this</span>.digits = <span class="org-keyword">new</span> <span class="org-type">int</span>[digitsLength];
  <span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; <span class="org-type">digitsLength</span>; ++i) {
    <span class="org-type">String</span> <span class="org-variable-name">block</span> = digitsString.substring(Math.max(head + (i - 1) * BASE_DECIMAL_DIGITS, 0), head + i * BASE_DECIMAL_DIGITS);
    <span class="org-keyword">this</span>.digits[digitsLength - i - 1] = Integer.parseInt(block);
  }
}
</pre>
</div>

<p>
而将 1000000000 进制的整数数组转换为 10 进制字符串也可以通过格式化字符串简单实现：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">BigInteger</span> {
  <span class="org-keyword">public</span> <span class="org-type">String</span> <span class="org-function-name">toString</span>() {
    <span class="org-type">Formatter</span> <span class="org-variable-name">formatter</span> = <span class="org-keyword">new</span> <span class="org-type">Formatter</span>();

    formatter.format(<span class="org-string">"%d"</span>, digits[digits.length - 1]);
    <span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">i</span> = digits.length - 2; i &gt;= 0; --i) {
      formatter.format(<span class="org-string">"%09d"</span>, digits[i]);
    }

    <span class="org-keyword">return</span> formatter.toString();
  }
</pre>
</div>

<p>
效果：
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span class="org-keyword">import</span> BigInteger
&gt;&gt;&gt; BigInteger(<span class="org-string">"1234684654687654354896735454"</span>)
1234684654687654354896735454
</pre>
</div>

<p>
<b>注：</b> 这里的测试是通过 <code>Jython</code> 完成的，用 <code>Jython</code> 来进行简单的 Java 测试是一个很不错的选择
</p>
</div>
</div>

<div id="outline-container-orgb24d0b6" class="outline-2">
<h2 id="orgb24d0b6"><span class="section-number-2">6</span> 大数加法</h2>
<div class="outline-text-2" id="text-6">
<p>
整数数组的大数加法和字符数组的大数加法在实现上是差不多的，所有就直接上代码好了：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-type">BigInteger</span> <span class="org-function-name">plus</span>(<span class="org-type">BigInteger</span> <span class="org-variable-name">other</span>) {
  <span class="org-type">int</span>[] <span class="org-variable-name">result</span> = <span class="org-keyword">new</span> <span class="org-type">int</span>[Math.max(<span class="org-keyword">this</span>.digits.length, other.digits.length) + 1];
  System.arraycopy(<span class="org-keyword">this</span>.digits, 0, result, 0, <span class="org-keyword">this</span>.digits.length);

  <span class="org-type">int</span> <span class="org-variable-name">carry</span> = 0;
  <span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; other.digits.<span class="org-type">length</span>; ++i) {
    <span class="org-type">int</span> <span class="org-variable-name">sum</span> = carry + result[i] + other.digits[i];
    result[i] = sum % BASE;
    carry = sum / BASE;
  }

  <span class="org-keyword">if</span> (carry != 0) {
    <span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">i</span> = other.digits.length; i &lt; result.<span class="org-type">length</span> &amp;&amp; carry != 0; ++i) {
      <span class="org-type">int</span> <span class="org-variable-name">sum</span> = carry + result[i];
      result[i] = sum % BASE;
      carry = sum / BASE;
    }
  }

  <span class="org-keyword">if</span> (result[result.length - 1] == 0) {
    result = Arrays.copyOfRange(result, 0, result.length - 1);
  }

  <span class="org-keyword">return</span> <span class="org-keyword">new</span> <span class="org-type">BigInteger</span>(result);
}
</pre>
</div>

<p>
测试：
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span class="org-variable-name">a</span> = BigInteger(<span class="org-string">"999999999999999999999999999999999999999999"</span>)
&gt;&gt;&gt; <span class="org-variable-name">b</span> = BigInteger(<span class="org-string">"111111111111111111111111111111111111111111"</span>)
&gt;&gt;&gt; a.plus(b)
1111111111111111111111111111111111111111110
</pre>
</div>
</div>
</div>

<div id="outline-container-org755a085" class="outline-2">
<h2 id="org755a085"><span class="section-number-2">7</span> 大数乘法</h2>
<div class="outline-text-2" id="text-7">
<p>
大数乘法我们可以借助 <b>long</b> 数组来辅助实现，因为，这样就不需要担心两个 <b>int</b> 相乘的溢出问题了，这也是为什么不选择 <b>long</b> 数组来实现大数的一个原因。
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-type">BigInteger</span> <span class="org-function-name">mul</span>(<span class="org-type">BigInteger</span> <span class="org-variable-name">other</span>) {
  <span class="org-type">long</span>[] <span class="org-variable-name">temp</span> = <span class="org-keyword">new</span> <span class="org-type">long</span>[<span class="org-keyword">this</span>.digits.length + other.digits.length];

  <span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; <span class="org-keyword">this</span>.digits.length; ++i) {
    <span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">j</span> = 0; j &lt; other.digits.<span class="org-type">length</span>; ++j) {
      temp[i + j] += (<span class="org-type">long</span>) <span class="org-keyword">this</span>.digits[i] * (<span class="org-type">long</span>) other.digits[j];
    }
  }

  <span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; temp.<span class="org-type">length</span>; ++i) {
    <span class="org-keyword">if</span> (temp[i] &gt;= BASE) {
      temp[i + 1] += temp[i] / BASE;
      temp[i] = temp[i] % BASE;
    }
  }

  <span class="org-type">int</span> <span class="org-variable-name">zeroCount</span> = 0;
  <span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">i</span> = temp.length - 1; i &gt;= 0; --i) {
    <span class="org-keyword">if</span> (temp[i] &gt; 0) {
      <span class="org-keyword">break</span>;
    }
    zeroCount++;
  }

  <span class="org-type">int</span>[] <span class="org-variable-name">result</span> = <span class="org-keyword">new</span> <span class="org-type">int</span>[temp.length - zeroCount];
  <span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; result.<span class="org-type">length</span>; ++i) {
    result[i] = (<span class="org-type">int</span>) temp[i];
  }

  <span class="org-keyword">return</span> <span class="org-keyword">new</span> <span class="org-type">BigInteger</span>(result);
}
</pre>
</div>

<p>
测试：
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span class="org-variable-name">a</span> = BigInteger(<span class="org-string">"999999999999999999999999999999999999999999"</span>)
&gt;&gt;&gt; <span class="org-variable-name">b</span> = BigInteger(<span class="org-string">"111111111111111111111111111111111111111111"</span>)
&gt;&gt;&gt; a.mul(b)
111111111111111111111111111111111111111110888888888888888888888888888888888888888889
</pre>
</div>
</div>
</div>

<div id="outline-container-org4ffdf72" class="outline-2">
<h2 id="org4ffdf72"><span class="section-number-2">8</span> 结语</h2>
<div class="outline-text-2" id="text-8">
<p>
这里的大数实现是很不完善的，本来是想尝试用 2 进制流来实现，但是尝试后才发现，有点麻烦，于是就放弃了。
</p>

<p>
但是，如果真的用 2 进制流来实现的话，其实也就只是相当于 <b>0xff</b> 进制的字符数组或 <b>0xffffffff</b> 进制的整数数组，主要是和十进制之间的转换有点麻烦。
</p>

<p>
而有些操作是需要用 2 进制流来实现才好完成的，比如大数的位运算。
</p>

<p>
这里的实现还没有涉及大数减法和大数除法，有兴趣的可以去尝试一下。
</p>

<p>
完整代码链接：<a href="https://gist.github.com/rgb-24bit/931e45660d8826fce2053c943d0b2c99">BigInteger.java</a>
</p>
</div>
</div>

<div id="outline-container-orgbc5bea8" class="outline-2">
<h2 id="orgbc5bea8"><span class="section-number-2">9</span> 参考链接</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li><a href="https://www.pediy.com/kssd/pediy05/pediy50664.htm">RSA 与大数运算</a></li>
<li><a href="https://codeday.me/bug/20170818/53558.html">如何在 Java 中处理非常大的数字，而不使用 java.math.BigInteger - 代码日志</a></li>
<li><a href="http://hg.openjdk.java.net/jdk8/jdk8/jdk/file/687fd7c7986d/src/share/classes/java/math/BigInteger.java">JDK 8 BigInteger 源码链接</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
版权声明：本作品采用<a rel="license" href="http://creativecommons.org/licenses/by-nc/4.0/">知识共享署名-非商业性使用 4.0 国际许可协议</a>进行许可
<div id="disqus_thread"></div>
<script type="text/javascript">
  var disqus_shortname = 'rgb-24bit';
  (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>
</div>
</body>
</html>
